#!/bin/bash


echo "========================================================================="
echo "1.If you need color echo ouput,you must add option -e"
echo "2.example : echo -e \"\\e[31m 红色字 \\e[0m\" "
echo "3.The end string always be \\e[0m "
echo "========================================================================="
echo -e "\e[31m\e[1m 红字高亮 \e[0m"'        :   \\e[31m\\e[1m            \\e[0m'
echo -e "\e[31m\e[1m\e[5m 红字高亮闪烁 \e[0m"'    :   \\e[31m\\e[1m\\e[5m       \\e[0m'
echo -e "\e[40;31m\e[5m\e[1m 黑底红字高亮闪烁 \e[0m"':   \\e[40;31m\\e[1m\\5[1m    \\e[0m'
echo -e "\e[32m\e[1m 绿字高亮 \e[0m"'        :   \\e[32m\\e[1m            \\e[0m'
echo -e "\e[32m\e[1m\e[5m 绿字高亮闪烁 \e[0m"'    :   \\e[32m\\e[1m\\e[5m       \\e[0m'
echo -e "\e[40;32m\e[5m\e[1m 黑底绿字高亮闪烁 \e[0m"':   \\e[40;32m\\e[1m\\5[1m    \\e[0m'
echo -e "\e[35m\e[1m 紫字高亮 \e[0m"'        :   \\e[35m\\e[1m            \\e[0m'
echo -e "\e[35m\e[1m\e[5m 紫字高亮闪烁 \e[0m"'    :   \\e[35m\\e[1m\\e[5m       \\e[0m'
echo -e "\e[40;35m\e[5m\e[1m 黑底紫字高亮闪烁 \e[0m"':   \\e[40;35m\\e[1m\\5[1m    \\e[0m'
echo -e "\e[34m\e[1m 蓝字高亮 \e[0m"'        :   \\e[34m\\e[1m            \\e[0m'
echo -e "\e[34m\e[1m\e[5m 蓝字高亮闪烁 \e[0m"'    :   \\e[34m\\e[1m\\e[5m       \\e[0m'
echo -e "\e[40;34m\e[5m\e[1m 黑底蓝字高亮闪烁 \e[0m"':   \\e[40;34m\\e[1m\\5[1m    \\e[0m'
echo "========================================================================="
echo -e "\e[30m 黑色字 \e[0m"':  \\e[30m    \\e[0m'   \|\|   "\e[40m 黑底 \e[0m"':  \\e[40m    \\e[0m'
echo -e "\e[31m 红色字 \e[0m"':  \\e[31m    \\e[0m'   \|\|   "\e[41m 红底 \e[0m"':  \\e[41m    \\e[0m'
echo -e "\e[32m 绿色字 \e[0m"':  \\e[32m    \\e[0m'   \|\|   "\e[42m 绿底 \e[0m"':  \\e[42m    \\e[0m'
echo -e "\e[33m 黄色字 \e[0m"':  \\e[33m    \\e[0m'   \|\|   "\e[43m 黄底 \e[0m"':  \\e[43m    \\e[0m'
echo -e "\e[34m 蓝色字 \e[0m"':  \\e[34m    \\e[0m'   \|\|   "\e[44m 蓝底 \e[0m"':  \\e[44m    \\e[0m'
echo -e "\e[35m 紫色字 \e[0m"':  \\e[35m    \\e[0m'   \|\|   "\e[45m 紫底 \e[0m"':  \\e[45m    \\e[0m'
echo -e "\e[36m 天蓝字 \e[0m"':  \\e[36m    \\e[0m'   \|\|   "\e[46m 天蓝 \e[0m"':  \\e[46m    \\e[0m'
echo -e "\e[37m 白色字 \e[0m"':  \\e[37m    \\e[0m'   \|\|   "\e[47m 白底 \e[0m"':  \\e[47m    \\e[0m'
echo "========================================================================="
echo -e "\e[47;30m 白底黑字 \e[0m"':   \\e[40;30m     \\e[0m   '\|\|   "\e[41;30m 红底黑字 \e[0m"':   \\e[41;30m     \\e[0m'
echo -e "\e[47;31m 白底红字 \e[0m"':   \\e[40;31m     \\e[0m   '\|\|   "\e[41;31m 红底红字 \e[0m"':   \\e[41;31m     \\e[0m'
echo -e "\e[47;32m 白底绿字 \e[0m"':   \\e[40;32m     \\e[0m   '\|\|   "\e[41;32m 红底绿字 \e[0m"':   \\e[41;32m     \\e[0m'
echo -e "\e[47;33m 白底黄字 \e[0m"':   \\e[40;33m     \\e[0m   '\|\|   "\e[41;33m 红底黄字 \e[0m"':   \\e[41;33m     \\e[0m'
echo -e "\e[47;34m 白底蓝字 \e[0m"':   \\e[40;34m     \\e[0m   '\|\|   "\e[41;34m 红底蓝字 \e[0m"':   \\e[41;34m     \\e[0m'
echo -e "\e[47;35m 白底紫字 \e[0m"':   \\e[40;35m     \\e[0m   '\|\|   "\e[41;35m 红底紫字 \e[0m"':   \\e[41;35m     \\e[0m'
echo -e "\e[47;36m 白蓝天字 \e[0m"':   \\e[40;36m     \\e[0m   '\|\|   "\e[41;36m 红蓝天字 \e[0m"':   \\e[41;36m     \\e[0m'
echo -e "\e[47;37m 白底白字 \e[0m"':   \\e[40;37m     \\e[0m   '\|\|   "\e[41;37m 红底白字 \e[0m"':   \\e[41;37m     \\e[0m'
echo "========================================================================="
echo -e "\e[40;37m \e[5m 黑底白字闪烁 \e[0m"':   \\e[40;37m \\e[5m      \\e[0m'
echo -e "\e[41;37m \e[5m 红底白字闪烁 \e[0m"':   \\e[41;37m \\e[5m      \\e[0m'
echo -e "\e[42;37m \e[5m 绿底白字闪烁 \e[0m"':   \\e[42;37m \\e[5m      \\e[0m'
echo -e "\e[43;37m \e[5m 黄底白字闪烁 \e[0m"':   \\e[43;37m \\e[5m      \\e[0m'
echo -e "\e[44;37m \e[5m 蓝底白字闪烁 \e[0m"':   \\e[44;37m \\e[5m      \\e[0m'
echo -e "\e[45;37m \e[5m 紫底白字闪烁 \e[0m"':   \\e[45;37m \\e[5m      \\e[0m'
echo -e "\e[46;37m \e[5m 天底白字闪烁 \e[0m"':   \\e[46;37m \\e[5m      \\e[0m'
echo -e "\e[47;37m \e[5m 白底白字闪烁 \e[0m"':   \\e[47;37m \\e[5m      \\e[0m'
echo "========================================================================="
